ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTachi/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

         /*##  ### #   #      ###  ####  ####   ###  #   #  ###
          #   #  #  ##  #     #   # #   # #   # #   #  # #  #
          ####   #  # # #     ##### ####  ####  #####   #    ###
          #      #  #  ##     #   # #  #  #  #  #   #   #       #
          #     ### #   #     #   # #   # #   # #   #   #    # */
#ifdef ARDUINO_MAIN
  // Indexed by digital pin number (0..23). Gaps and USB pins are NOT_A_PORT.
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0 RX (Serial1)
    PA,         //  1 PA4  D1 TX (Serial1)
    PA,         //  2 PA2  D2 SDA
    PA,         //  3 PA3  D3 SCL/TCB1
    PF,         //  4 PF1  D4
    PD,         //  5 PD0  D5 TCA0 WO0
    PD,         //  6 PD1  D6 TCA0 WO1
    PA,         //  7 PA1  D7
    PC,         //  8 PC3  D8 LUT1-OUT
    PD,         //  9 PD2  D9 TCA0 WO2
    PD,         // 10 PD3  D10 TCA0 WO3
    NOT_A_PORT, // 11 (gap)
    NOT_A_PORT, // 12 (gap)
    NOT_A_PORT, // 13 (gap)
    PD,         // 14 PD5  D14 MISO
    PD,         // 15 PD6  D15 SCK/Serial2 TX
    PD,         // 16 PD4  D16 MOSI
    PA,         // 17 PA0  D17 LED_BUILTIN / RX LED
    PD,         // 18 PD7  D18 A0/SS/Serial2 RX
    PF,         // 19 PF0  D19 A1
    PA,         // 20 PA6  D20 A2/XCK
    PA,         // 21 PA7  D21 A3/XDIR/EVOUTA
    PF,         // 22 PF6  RESET
    PF          // 23 PF7  UPDI
  };

  /* Bit position within the port (for PINnCTRL access). */
  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5
    PIN4_bp,   //  1 PA4
    PIN2_bp,   //  2 PA2
    PIN3_bp,   //  3 PA3
    PIN1_bp,   //  4 PF1
    PIN0_bp,   //  5 PD0
    PIN1_bp,   //  6 PD1
    PIN1_bp,   //  7 PA1
    PIN3_bp,   //  8 PC3
    PIN2_bp,   //  9 PD2
    PIN3_bp,   // 10 PD3
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bp,   // 14 PD5
    PIN6_bp,   // 15 PD6
    PIN4_bp,   // 16 PD4
    PIN0_bp,   // 17 PA0
    PIN7_bp,   // 18 PD7
    PIN0_bp,   // 19 PF0
    PIN6_bp,   // 20 PA6
    PIN7_bp,   // 21 PA7
    PIN6_bp,   // 22 PF6 RESET
    PIN7_bp    // 23 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5
    PIN4_bm,   //  1 PA4
    PIN2_bm,   //  2 PA2
    PIN3_bm,   //  3 PA3
    PIN1_bm,   //  4 PF1
    PIN0_bm,   //  5 PD0
    PIN1_bm,   //  6 PD1
    PIN1_bm,   //  7 PA1
    PIN3_bm,   //  8 PC3
    PIN2_bm,   //  9 PD2
    PIN3_bm,   // 10 PD3
    NOT_A_PIN, // 11 (gap)
    NOT_A_PIN, // 12 (gap)
    NOT_A_PIN, // 13 (gap)
    PIN5_bm,   // 14 PD5
    PIN6_bm,   // 15 PD6
    PIN4_bm,   // 16 PD4
    PIN0_bm,   // 17 PA0
    PIN7_bm,   // 18 PD7
    PIN0_bm,   // 19 PF0
    PIN6_bm,   // 20 PA6
    PIN7_bm,   // 21 PA7
    PIN6_bm,   // 22 PF6 RESET
    PIN7_bm    // 23 PF7 UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. Only the TCB outputs are listed (PA2=TCB0, PA3=TCB1). */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5
    NOT_ON_TIMER, //  1 PA4
    TIMERB0,      //  2 PA2  (TCB0 - used for millis on this board)
    TIMERB1,      //  3 PA3  (TCB1 - D3 PWM)
    NOT_ON_TIMER, //  4 PF1
    NOT_ON_TIMER, //  5 PD0  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  7 PA1
    NOT_ON_TIMER, //  8 PC3
    NOT_ON_TIMER, //  9 PD2  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 (gap)
    NOT_ON_TIMER, // 12 (gap)
    NOT_ON_TIMER, // 13 (gap)
    NOT_ON_TIMER, // 14 PD5  (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 15 PD6
    NOT_ON_TIMER, // 16 PD4  (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 17 PA0
    NOT_ON_TIMER, // 18 PD7
    NOT_ON_TIMER, // 19 PF0
    NOT_ON_TIMER, // 20 PA6
    NOT_ON_TIMER, // 21 PA7
    NOT_ON_TIMER, // 22 PF6 RESET
    NOT_ON_TIMER  // 23 PF7 UPDI
  };
#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part, treated like the 32U4)
 * =================================================================
 *  USBCON enables Arduino's HID / Keyboard / Mouse / etc. on this board.
 *  NOTE: the native USB-CDC descriptor's VID/PID/product string are taken
 *  from cores/dxcore/usb_descriptors.{h,c} (which does NOT include this
 *  file), so the values below are informational only - keep them in sync.
 *  Effective app identity: 0x1209:0x0006, product "Wazamono Tachi".
 *  Obtain a real product VID/PID before release (pid.codes = dev only).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x0006
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "Workshop Asahi"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "Wazamono Tachi"
#endif

/* =================================================================
 *  Serial -> native USB CDC   (Leonardo/Micro convention)
 * =================================================================
 *  Serial  = USBSerial (on-chip USB CDC)              <- primary / USB serial monitor
 *  Serial1 = USART0   (D0/D1, ALT1 - the Pro Micro hardware UART; alias of the
 *                      core's Serial0 object, see WAZAMONO_SERIAL1_IS_USART0)
 *  Serial2 = USART1   (D15 TX / D18 RX, ALT2 - extra UART; shares pins with SPI
 *                      SCK/SS, so Serial2 and SPI are mutually exclusive)
 *  Serial0 remains the DxCore-internal name for USART0 (same object as Serial1).
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (from boards.txt) to keep Serial==USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* Pro Micro hardware UART on D0/D1 */
  #endif
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN  Serial2  /* extra UART on D15/D18 (USART1) */
  #endif
#endif

#endif
